In [2]:
import pandas as pd

In [4]:
list = ['g', 'e', 'e', 'k', 's']

# create series form a list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [6]:
dict = {'Geeks': 10,
		'for': 20,
		'geeks': 30}

# create series from dictionary
ser2 = pd.Series(dict)

print(ser2)

Geeks    10
for      20
geeks    30
dtype: int64

In [7]:
ser3 = pd.Series(10, index=[0, 1, 2, 3, 4, 5])
 
print(ser3)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [8]:
ser4 = pd.Series(range(10))
print(ser4)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [12]:
ser3.head()

0    10
1    10
2    10
3    10
4    10
dtype: int64

In [13]:
ser3[:3]

0    10
1    10
2    10
dtype: int64

In [14]:
ser3[[0,1,2]]

0    10
1    10
2    10
dtype: int64

In [9]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [10]:
# importing pandas module
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'a': ['Geeks', 'For', 'geeks', 'for', 'real'],
					'b': [11, 1.025, 333, 114.48, 1333]})
					
data = {'item1':df1, 'item2':df1}

# creating Panel
panel = pd.Panel.from_dict(data, orient ='minor')

print("panel['b'] is - \n\n", panel['b'], '\n')

print("\nSize of panel['b'] is - ", panel['b'].shape)

AttributeError: module 'pandas' has no attribute 'Panel'

In [11]:
#To check the version of pandas library
import pandas
print(pandas.__version__)

1.4.3

In [15]:
# Import pandas package
import pandas as pd

# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
		'Age':[27, 24, 22, 32],
		'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

# select two columns
df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [21]:
address = {'Delhi': 'Jai', 'Bangalore': 'Princi',
           'Patna': 'Gaurav', 'Chennai': 'Anuj'}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
  
# Provide 'Address' as the column name
df['Address'] = address

#Using assign method

df2 = df.assign(address=['Delhi', 'Bangalore', 'Chennai', 'Patna'])

address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']
  
# Using 'Address' as the column name
# and equating it to the list
df['Address'] = address

In [23]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24  Bangalore            MA
2  Gaurav   22    Chennai           MCA
3    Anuj   32      Patna           Phd

In [24]:
df = pd.DataFrame({"a": [1,2,3], "b":[2,4,6]})
print("The DataFrame object before deleting the column")
print(df)
del df["a"]
print("The DataFrame object after deleting the column a")
print(df)

The DataFrame object before deleting the column
   a  b
0  1  2
1  2  4
2  3  6
The DataFrame object after deleting the column a
   b
0  2
1  4
2  6

In [26]:
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  
df = pd.DataFrame(dict)

df2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}
df = df.append(df2, ignore_index = True)
df

/var/folders/8h/gd6cyl8558d6l_cv84_k3ntw0000gp/T/ipykernel_7644/620680588.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index = True)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

In [33]:
# Python program to implement
# index attribute in a dataframe object
import pandas as pd

# creating a 2D dictionary
dict = {"Student": ["Arnav", "Neha",
					"Priya", "Rahul"],
		"Marks": [85, 92, 78, 83],
		"Sports": ["Cricket", "Volleyball",
				"Hockey", "Badminton"]}

# creating a DataFrame
df = pd.DataFrame(dict)

# printing this DataFrame on the
# output screen
display(df)

# Implementing index attribute on
# this DataFrame
print(df.index)

#shows the columns
print(df.columns)

#shows ths axes
print(df.axes)

#shows the dtypes
print(df.dtypes)

#shows the size of dataframe
print(df.size)

#shows no of columns and rows of dataframe
print(df.shape)

print(df.ndim)

#checks if the dataframe is empty
print(df.empty)

#transposes the dataframe
print(df.T)

#prints all values from dataframe
print(df.values)

  Student  Marks      Sports
0   Arnav     85     Cricket
1    Neha     92  Volleyball
2   Priya     78      Hockey
3   Rahul     83   Badminton

RangeIndex(start=0, stop=4, step=1)
Index(['Student', 'Marks', 'Sports'], dtype='object')
[RangeIndex(start=0, stop=4, step=1), Index(['Student', 'Marks', 'Sports'], dtype='object')]
Student    object
Marks       int64
Sports     object
dtype: object
12
(4, 3)
2
False
               0           1       2          3
Student    Arnav        Neha   Priya      Rahul
Marks         85          92      78         83
Sports   Cricket  Volleyball  Hockey  Badminton
[['Arnav' 85 'Cricket']
 ['Neha' 92 'Volleyball']
 ['Priya' 78 'Hockey']
 ['Rahul' 83 'Badminton']]

In [38]:
# import pandas package as pd
import pandas as pd

# Define a dictionary containing students data
data = {'Name': ['Ankit', 'Amit', 'Aishwarya',
				'Priyanka'],
		'Age': [21, 19, 20, 18],
		'Stream': ['Math', 'Commerce', 'Arts',
				'Biology'],
		'Percentage': [88, 92, 95, 70]}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age',
								'Stream',
								'Percentage'])

print("Given Dataframe :\n", df)

print("\nIterating over rows using itertuples() method :\n")

# iterate through each row and select
# 'Name' and 'Percentage' column respectively.
for row in df.itertuples(index=True):
	print(getattr(row, "Name"), getattr(row, "Percentage"))

#through iterrows
print("\nIterating over rows using iterrows() method :\n")
for index, row in df.iterrows():
    print(row["Name"], row["Age"])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using itertuples() method :

Ankit 88
Amit 92
Aishwarya 95
Priyanka 70

Iterating over rows using iterrows() method :

Ankit 21
Amit 19
Aishwarya 20
Priyanka 18

In [39]:
# importing pandas library 
import pandas as pd 

# creating and initializing a nested list 
age_list = [['Afghanistan', 1952, 8425333, 'Asia'], 
			['Australia', 1957, 9712569, 'Oceania'], 
			['Brazil', 1962, 76039390, 'Americas'], 
			['China', 1957, 637408000, 'Asia'], 
			['France', 1957, 44310863, 'Europe'], 
			['India', 1952, 3.72e+08, 'Asia'], 
			['United States', 1957, 171984000, 'Americas']] 

# creating a pandas dataframe 
df = pd.DataFrame(age_list, columns=['Country', 'Year', 
									'Population', 'Continent'])

df

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [40]:
df.sort_values(by=['Country'])

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [41]:
df.sort_values(by=['Population'], ascending=False)

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [42]:
# Sorting by column "Population" 
# by putting missing values first 
df.sort_values(by=['Population'], na_position='first')

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
4         France  1957   44310863.0    Europe
2         Brazil  1962   76039390.0  Americas
6  United States  1957  171984000.0  Americas
5          India  1952  372000000.0      Asia
3          China  1957  637408000.0      Asia

In [43]:
# Sorting by columns "Country" and then "Continent" 
df.sort_values(by=['Country', 'Continent'])

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [44]:
dict = {'Geeks': 10,
		'for': 20,
		'geeks': 30}

# create series from dictionary
ser2 = pd.Series(dict)

print(ser2)

Geeks    10
for      20
geeks    30
dtype: int64

In [52]:
#Defines the index of the ser2.
print(ser2.index)

#It returns a tuple of shape of the data.
print(ser2.shape)

#It returns the data type of the data.
print(ser2.dtype)	

#It returns the size of the data.
print(ser2.size)	

#It returns True if ser2 object is empty, otherwise returns false.
print(ser2.empty)	

#It returns True if there are any NaN values, otherwise returns false.
print(ser2.hasnans)	

#It returns the number of bytes in the data.
print(ser2.nbytes)	

#It returns the number of dimensions in the data.
print(ser2.ndim)

#It returns the size of the datatype of item.

Index(['Geeks', 'for', 'geeks'], dtype='object')
(3,)
int64
3
False
False
24
1

In [53]:
# importing pandas library 
import pandas as pd 

# creating and initializing a nested list 
age_list = [['Afghanistan', 1952, 8425333, 'Asia'], 
			['Australia', 1957, 9712569, 'Oceania'], 
			['Brazil', 1962, 76039390, 'Americas'], 
			['China', 1957, 637408000, 'Asia'], 
			['France', 1957, 44310863, 'Europe'], 
			['India', 1952, 3.72e+08, 'Asia'], 
			['United States', 1957, 171984000, 'Americas']] 

# creating a pandas dataframe 
df = pd.DataFrame(age_list, columns=['Country', 'Year', 
									'Population', 'Continent'])

In [55]:
first = data.loc["Afghanistan"]
second = data.loc["Brazil"]
print(first, "\n\n\n", second)

AttributeError: 'dict' object has no attribute 'loc'

In [2]:
import pandas as pd

In [3]:
csv = pd.read_csv('username-or-email.csv')

In [5]:
print(csv)

                     Username        Login email Identifier First name  \
0  booker12rachel@example.com               9012     Rachel     Booker
1                      grey07                NaN       2070      Laura
2                   johnson81               4081      Craig    Johnson
3                   jenkins46   mary@example.com       9346       Mary
4                     smith79  jamie@example.com       5079      Jamie

  Last name
0       NaN
1      Grey
2       NaN
3   Jenkins
4     Smith